stm32duino/Arduino_Core_STM32/system/Drivers/STM32WBAxx_HAL_Driver/Src/stm32wbaxx_hal_rcc_ex.c
  MODIFY_REG(RCC->ECSCR1, RCC_ECSCR1_HSETRIM, Trimming << RCC_ECSCR1_HSETRIM_Pos);
}

/**
  * @brief  Get HSE trimming value
  * @retval The programmed HSE trimmign value
  */
uint32_t HAL_RCCEx_HSEGetTrimming(void)
{
  return ((RCC->ECSCR1 & RCC_ECSCR1_HSETRIM) >> RCC_ECSCR1_HSETRIM_Pos);
}

/**
  * @brief  Set LSE trimming value
  * @param  Trimming  specifies the Low Speed clock source to output.
  *          This parameter can be one of the following values:
  *            @arg @ref RCC_LSETRIMMING_R  current source resistance R
  *            @arg @ref RCC_LSETRIMMING_3_4_R  current source resistance 3/4*R
  *            @arg @ref RCC_LSETRIMMING_2_3_R  current source resistance 2/3*R
  *            @arg @ref RCC_LSETRIMMING_1_2_R  current source resistance 1/2*R
  * @retval None
  */
void HAL_RCCEx_LSESetTrimming(uint32_t Trimming)
{
  /* Check the parameters */
  assert_param(IS_RCC_LSETRIM(Trimming));

  MODIFY_REG(RCC->BDCR1, RCC_BDCR1_LSETRIM, Trimming);
}

/**
  * @brief  Get LSE trimming value
  * @retval The programmed LSE trimmign value
  */
uint32_t HAL_RCCEx_LSEGetTrimming(void)
{
  return (RCC->BDCR1 & RCC_BDCR1_LSETRIM);
}

#if defined(RCC_LSI2_SUPPORT)
/**
  * @brief  Set LSI2 Configuration
  * @param  pConfig pointer to an RCC_LSIConfigTypeDef structure that
  *         contains the configuration information for the LSI2 oscillattor
  * @retval None
  */
void HAL_RCCEx_LSI2SetConfig(const RCC_LSIConfigTypeDef *pConfig)
{
  /* Check the parameters */
  assert_param(pConfig != NULL);
  assert_param(IS_RCC_LSI2_FREQTEMPSENS(pConfig->FreqTempSens));
  assert_param(IS_RCC_LSI2_OPERATINGMODE(pConfig->OpMode));

  WRITE_REG(RCC->BDCR2, (pConfig->FreqTempSens | pConfig->OpMode));
}

/**
  * @brief  Set LSI2 Configuration
  * @param  pConfig pointer to an RCC_LSIConfigTypeDef structure that
  *         contains the configuration information for the LSI2 oscillattor
  * @retval None
  */
void HAL_RCCEx_LSI2GetConfig(RCC_LSIConfigTypeDef *pConfig)
{
  uint32_t regbdcr2;

  /* Check the parameters */
  assert_param(pConfig != NULL);

  /* Get register value */
  regbdcr2 = RCC->BDCR2;

  pConfig->FreqTempSens = (regbdcr2 & RCC_BDCR2_LSI2CFG);
  pConfig->OpMode = (regbdcr2 & RCC_BDCR2_LSI2MODE);
}

#endif /* RCC_BDCR1_LSI2ON */

/**
  * @}
  */

/** @defgroup RCCEx_Exported_Functions_Group3 Radio clock management functions
  *  @brief  Radio clock management functions
  *
@verbatim
 ===============================================================================
                ##### Extended radio clock management functions  #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to control the
    radio-related parameters.
@endverbatim
  * @{
  */

/**
  * @brief  Enable the 2.4 GHz RADIO baseband clock
  * @retval None
  */
void HAL_RCCEx_EnableRadioBBClock(void)
{
  SET_BIT(RCC->RADIOENR, RCC_RADIOENR_BBCLKEN);
}

/**
  * @brief  Disable the 2.4 GHz RADIO baseband clock
  * @retval None
  */
void HAL_RCCEx_DisableRadioBBClock(void)
{
  CLEAR_BIT(RCC->RADIOENR, RCC_RADIOENR_BBCLKEN);
}

/**
  * @brief  Enable the 2.4 GHz RADIO bus clock and HSE32 oscillator by 2.4 GHz RADIO sleep timer wakeup event
  * @retval None
  */
void HAL_RCCEx_EnableRequestUponRadioWakeUpEvent(void)
{
  SET_BIT(RCC->RADIOENR, RCC_RADIOENR_STRADIOCLKON);
}

/**
  * @brief  Disable the 2.4 GHz RADIO bus clock and HSE32 oscillator by 2.4 GHz RADIO sleep timer wakeup event
  * @retval None
  */
void HAL_RCCEx_DisableRequestUponRadioWakeUpEvent(void)
{
  CLEAR_BIT(RCC->RADIOENR, RCC_RADIOENR_STRADIOCLKON);
}

/**
  * @brief Get the 2.4 GHz RADIO bus clock readiness.
  * @note  Indicate that the 2.4 GHz RADIO bus clock is ready and the 2.4 GHz RADIO registers can be accessed.
  * @note  The output can be one of the following values :
  *         @arg RCC_RADIO_BUS_CLOCK_NOT_READY  : 2.4 GHz RADIO bus clock not ready.
  *         @arg RCC_RADIO_BUS_CLOCK_READY :  2.4 GHz RADIO bus clock ready.
  * @retval The regulator REG_VDDHPA input supply selection.
  */
uint32_t HAL_RCCEx_GetRadioBusClockReadiness(void)
{
  return READ_BIT(RCC->RADIOENR, RCC_RADIOENR_RADIOCLKRDY);
}
/**
  * @}
  */

/**
  * @}
  */

#endif /* HAL_RCC_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */
